# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''
ipm=input("Ip вводи быстро: ")
ip=ipm[0:ipm.find('/')]
#print(ip)
oc=ip.split('.')
#print(oc)
print(f'''Network
     {int(oc[0]):<10} {int(oc[1]):<10} {int(oc[2]):<10} {int(oc[3]):<10}
     {int(oc[0]):010b} {int(oc[1]):010b} {int(oc[2]):010b} {int(oc[3]):010b}''')

m=ipm[ipm.find('/')+1:]
print(m)
mi=int(m)
mb='1'*mi +'0'*(32-mi)
print(mb[:8])

print(f'''
Mask
     {int(mb[0:8], 2):<8} {int(mb[8:16],2):<8} {int(mb[16:24], 2):<8} {int(mb[24:32], 2):<8}
     {int(mb[0:8]):08} {int(mb[8:16]):08} {int(mb[16:24]):08} {int(mb[24:32]):08}''')
#print(f'')